app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "I want to grow up to be Tony Stark!"], ["created_at", "2016-04-27 20:22:24.653324"], ["movie_id", 1], ["name", "Pablo"], ["stars", 5], ["updated_at", "2016-04-27 20:22:24.653324"]]