app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["name", "Steven Jobs"], ["updated_at", "2016-05-02 22:27:13.046352"]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)